# Letnie igrzyska olimpijskie

### 1.

Wczytaj tabelę z dokonaniami medalowymi 'summer_1976_2008.pkl'.

In [1]:
import pandas as pd

In [5]:
olimp = pd.read_pickle('summer_1976_2008.pkl')

In [6]:
olimp.head()

,City,Year,Sport,Discipline,Event,Athlete,Gender,Country_Code,Country,Event_gender,Medal
0,Montreal,1976,Aquatics,Diving,3m springboard,"KÖHLER, Christa",Women,GDR,East Germany,W,Silver
1,Montreal,1976,Aquatics,Diving,3m springboard,"KOSENKOV, Aleksandr",Men,URS,Soviet Union,M,Bronze
2,Montreal,1976,Aquatics,Diving,3m springboard,"BOGGS, Philip George",Men,USA,United States,M,Gold
3,Montreal,1976,Aquatics,Diving,3m springboard,"CAGNOTTO, Giorgio Franco",Men,ITA,Italy,M,Silver
4,Montreal,1976,Aquatics,Diving,10m platform,"WILSON, Deborah Keplar",Women,USA,United States,W,Bronze

### 2.


Ile kobiet i ilu mężczyzn wzięło udział w zmaganiach olimpijskich?

In [7]:
olimp.groupby(['Gender', 'Event_gender']).size().unstack()

Event_gender       M       W      X
Gender
Men           8817.0     1.0  570.0
Women            NaN  5772.0  156.0

In [9]:
licz = olimp['Gender'].value_counts()
licz

Gender
Men      9388
Women    5928
Name: count, dtype: Int64

In [10]:
olimp.Event_gender.value_counts()

Event_gender
M    8817
W    5773
X     726
Name: count, dtype: Int64

### 3.


Ile kobiet i ile mężczyzn wzięło udział w zmaganiach olimpijskich w poszczególnych latach?

In [11]:
Olimp2 = olimp.groupby(['Year', 'Gender']).size().unstack()
Olimp2

Gender  Men    Women
Year
1976      924    381
1980      958    429
1984      973    486
1988     1011    535
1992     1105    600
1996     1082    777
2000     1126    889
2004     1099    899
2008     1110    932

In [21]:
olimp.groupby('Year').Event_gender.value_counts().unstack()

Event_gender     M    W    X
Year
1976           843  372   90
1980           854  423  110
1984           911  468   80
1988           950  518   78
1992          1041  586   78
1996          1029  755   75
2000          1065  869   81
2004          1052  878   68
2008          1072  904   66

In [22]:
olimp.groupby(['Year','Gender']).size().unstack()

Gender  Men    Women
Year
1976      924    381
1980      958    429
1984      973    486
1988     1011    535
1992     1105    600
1996     1082    777
2000     1126    889
2004     1099    899
2008     1110    932

### 4.


Utwórz ramkę z procentowym udziałem kobiet względem poszczególnych lat, w których odbywały się igrzyska.

In [27]:
round(2.323232,2)

2.32

In [23]:
Olimp2['W+M']=Olimp2['Men']+Olimp2['Women']
Olimp2['W%']=Olimp2['Women']/Olimp2['W+M']
Olimp2

Gender  Men    Women  W+M       W%
Year
1976      924    381   1305  0.291954
1980      958    429   1387  0.309301
1984      973    486   1459  0.333105
1988     1011    535   1546  0.346054
1992     1105    600   1705  0.351906
1996     1082    777   1859  0.417967
2000     1126    889   2015  0.441191
2004     1099    899   1998  0.449950
2008     1110    932   2042  0.456415

In [39]:
F_udzial = olimp.groupby(['Year', 'Gender']).size().unstack()
F_udzial = F_udzial.fillna(0)
F_udzial['Suma'] = F_udzial.sum(axis=1)
F_udzial['Udzial_F'] = (round(F_udzial['Women'] / F_udzial['Suma'],3) * 100)
F_udzial

Gender  Men       Women     Suma      Udzial_F
Year
1976         924       381      1305      29.2
1980         958       429      1387      30.9
1984         973       486      1459      33.3
1988        1011       535      1546      34.6
1992        1105       600      1705      35.2
1996        1082       777      1859      41.8
2000        1126       889      2015      44.1
2004        1099       899      1998      45.0
2008        1110       932      2042      45.6

### 5. 


Wyświetl ramkę 10 najbardziej utytułowanych medalistów zgodnie z rankingiem:
* brąz -- 1 punkt,
* srebro -- 2 punkty,
* złoto -- 6 punktów

In [40]:
df = olimp.groupby(['Athlete', 'Medal']).size().unstack().fillna(0).astype('int')
df['Ranking'] = 6*df.Gold + 2*df.Silver + df.Bronze
df.sort_values(by='Ranking', ascending=False, inplace=True)
df.head()

Medal            Bronze   Gold     Silver   Ranking
Athlete
PHELPS, Michael        2       14        0       86
FISCHER, Birgit        0        8        4       56
LEWIS, Carl            0        9        1       56
THOMPSON, Jenny        1        8        3       55
BIONDI, Matthew        1        8        2       53

In [ ]:
points_mapping = {'Gold': 6, 'Silver': 2, 'Bronze': 1}

In [43]:
medals_df['Medal'].map(points_mapping)

0        2
1        1
2        6
3        2
4        1
        ..
15428    1
15429    6
15430    2
15431    6
15432    6
Name: Medal, Length: 15316, dtype: int64

In [46]:
medals_df = pd.read_pickle('summer_1976_2008.pkl') 
# Definiowanie punktów dla każdego medalu 
points_mapping = {'Gold': 6, 'Silver': 2, 'Bronze': 1} 
# Dodanie kolumny z punktami 
medals_df['Points'] = medals_df['Medal'].map(points_mapping) 
# Grupowanie według medalistów i sumowanie punktów 
ranking = medals_df.groupby('Athlete')['Points'].sum() 
# Sortowanie według punktów w porządku malejącym i wybranie 10 najlepszych 
top_10 = ranking.sort_values(ascending=False).head(10) 
# Wyświetlenie wyników 
top_10

Athlete
PHELPS, Michael       86
FISCHER, Birgit       56
LEWIS, Carl           56
THOMPSON, Jenny       55
BIONDI, Matthew       53
ANDRIANOV, Nikolay    46
SCHERBO, Vitaly       40
HALL, Gary Jr.        38
THORPE, Ian           37
COMANECI, Nadia       37
Name: Points, dtype: int64

### 6.

Przyjmując ranking z punktu 5. wyświetl 10 najbardziej utytułowanych medalistów (dowolnej płci) w dyscyplinie *Swimming*.

In [48]:
df2 = olimp[olimp.Discipline=='Swimming'].groupby(['Athlete', 'Medal']).size().unstack().fillna(0).astype('int')
df2['Ranking'] = 6*df.Gold + 2*df.Silver + df.Bronze
df2.sort_values(by='Ranking', ascending=False, inplace=True)
df2 = df2[['Gold', 'Silver', 'Bronze', 'Ranking']]
df2.head(10)

Medal             Gold     Silver   Bronze   Ranking
Athlete
PHELPS, Michael        14        0        2       86
THOMPSON, Jenny         8        3        1       55
BIONDI, Matthew         8        2        1       53
HALL, Gary Jr.          5        3        2       38
THORPE, Ian             5        3        1       37
OTTO, Kristin           6        0        0       36
TORRES, Dara            4        4        4       36
VAN DYKEN, Amy          6        0        0       36
POPOV, Alexander        4        5        0       34
PEIRSOL, Aaron          5        2        0       34

### 7.

Przyjmując ranking z punktu 5. wyświetl 10 najbardziej utytułowanych **medalistek** w dyscyplinie *Swimming*.

In [55]:
round(0.5)

0

In [54]:
round(0.51)

1

In [72]:
np.round(0.5,1)

0.5

In [68]:
np.round_(0.51)

1.0

In [56]:
import numpy as np

In [60]:
np.floor(1.1)

1.0

In [63]:
np.ceil(1.99)

2.0

In [64]:
np.ceil(1.00001)

2.0

In [49]:
df2 = olimp[(olimp.Discipline=='Swimming')&(olimp.Gender=='Women')].groupby(['Athlete', 'Medal']).size().unstack().fillna(0).astype('int')
df2['Ranking'] = 6*df.Gold + 2*df.Silver + df.Bronze
df2.sort_values(by='Ranking', ascending=False, inplace=True)
df2.head(10)

Medal                 Bronze   Gold     Silver   Ranking
Athlete
THOMPSON, Jenny             1        8        3       55
TORRES, Dara                4        4        4       36
VAN DYKEN, Amy              0        6        0       36
OTTO, Kristin               0        6        0       36
EGERSZEGI, Krisztina        1        5        1       33
DE BRUIJN, Inge             2        4        2       30
COUGHLIN, Natalie           4        3        4       30
JONES, Leisel               1        3        4       27
THOMAS, Petria              1        3        4       27
ENDER, Kornelia             0        4        1       26